from sumy.summarizers.lex_rank import LexRankSummarizer
from sumy.nlp.tokenizers import Tokenizer
from sumy.parsers.plaintext import PlaintextParser
from janome.analyzer import Analyzer
from janome.charfilter import UnicodeNormalizeCharFilter, RegexReplaceCharFilter
from janome.tokenizer import Tokenizer as JanomeTokenizer  # sumyのTokenizerと名前が被るため
from janome.tokenfilter import POSKeepFilter, ExtractAttributeFilter

from sumy.summarizers.luhn import LuhnSummarizer

text = """第２話　没落令嬢様は極貧生活をする
　フェリシアたちがなんとか街に辿り着き、新しい生活を始めてから一年。
　アナベラは父親――チェルソン卿――と共にアルバ王国のとある街（偶然にもそこはフェリシアたちが新しい生活を始めた街であったが）を観光していた。
　チェルソン卿は厳しい顔で、アナベラを説教する。
「もう二度と、あのようなことをするな」
「うぅ……ごめんなさい」
　先日、アナベラは護衛を振り切って一人でこの街の郊外に広がる森へと遊びに出かけてしまったのだ。
　幸いにもアナベラは森の奥深くまでいかなかったために無事だったが……通称「迷いの森」と言われるその森は、奥深くまで足を踏み入れればもう二度と帰っては来れないという噂があるほど、危険な森だった。
（はぁ……どうして原作知識が通用しなかったんだろう？）
　勿論、アナベラも興味本位でそんな森の中に入ったわけではない。
　目的があったのだ。
　それは大魔導師マーリンと呼ばれる人物に、弟子入り志願をすることである。
　魔導師マーリンへの弟子入りは、特定のキャラ攻略のためのフラグの一つだ。
　勿論、折角剣と魔法の世界に転生したのだから、凄い魔法を教えて貰いたいという思いもある。
　そういうわけでマーリンを訪ねに行ったのだ。
　幸いにもアナベラは「マーリンが弟子を募集している」「マーリンは気難しいがマカロンが好物なので、マカロンを持ってくれば話だけは聞いてくれる」という原作知識を持っていた。
　故にマカロンを手に持って森に行き、森の中で「マーリン様、マカロンをあげるので話を聞いてください！」と叫ぶことでマーリンに会うことに成功した。
　しかし……
（マカロン食い逃げされたし……あーあ、最悪）
　アナベラはマーリンに出会った後のことを回想し、ため息をつく。
「何の用だ？」
「私を弟子にしてください！」
「……どうして？」
「魔導師になりたいんです！」
「……どうして？」
「魔導師に憧れて！　なるのが夢なんです！　それに……凄い魔法が使えるようになりたいです。あ、あと、私、魔法の才能があるんです！　それに魔力も無限なんですよ！」
「……論外」
　マーリンは一言、「論外」とアナベラに言い捨てるとどこかへと去っていってしまった。
　結果、アナベラはマカロンを食い逃げされた挙句に父親に説教を受けることになったのだ。
（ふん……別に、悔しくなんてないし。魔法学園で魔法を習えるし！　見返してやるわ！　私は原作知識もあるし、それに凄い魔法の才能と、無限の魔力を持っているのよ！）
　何が大魔導師だ、木草紙の作り方も知らなかったくせに。
　と、アナベラが思いながら歩いていると、チェルソン卿の足が止まった。
「おっと、すまないな。貴族のおっさん」
　丁度、走ってきた少年とぶつかってしまったためだ。
　年齢はアナベラと同じ、八、九歳程度。
　少年の顔は薄汚れ、はっきり言って清潔とは言い難かったが……しかしよく見ると非常に整っていることが分かる。
　また帽子から僅かに零れる髪も美しかった。
　アナベラは首を傾げる。
　どこかで見たことのあるような顔をしていたからだ。
（うーん……ゲームの攻略対象の一人、かな？　それとも脇役？）
　しかし……思い出せない。
　この街にはほかにも攻略キャラがいて、可能ならその人物を見ておこうという物見遊山もこの街に来た理由の一つなのだが……そのキャラとは見た目も違う。
「いや、大丈夫だ。君こそ怪我は……」
「無事で何よりだぜ！　じゃあ、私はこれで！！」
　少年は一目散に走り去っていく。
　……ポケットにあったはずの財布がなくなっていることに、チェルソン卿が気付いたのはそれから五分後のことだった。
「はぁ……はぁ……上手く行ったぜ」



　少年は額の汗を拭った。

　全力で走ったがためでもあるが、それ以上に盗み、窃盗によるところが大きい。

　それだけ緊張していたのだ。



「相変わらず、上手いな。フェリックス」

「才能あるぜ」



　ニヤニヤと笑いながら、十代後半ほどの少年たちがフェリックスの肩を叩く。　

　そして手を出した。



「分かっているよな？」

「……ああ、分かってるぜ」



　フェリックスはやや不満そうな表情で盗んだばかりの財布を渡す。　



「何だ、不満そうな顔だな」

「べ、別に不満なんて……っけほ」



　フェリックスの腹部に少年の膝がめり込んだ。

　膝を折り、苦しそうにお腹を抑えながら咳き込む。



「ほら、一割がお前の分け前だ」

「これからもよろしくな」



　そしてゲラゲラと笑いながら立ち去っていく。

　少年たちが見えなくなってから、フェリックスは舌打ちした。



　乱暴に帽子を取り、地面に叩きつける。



「この、クソファッキン野郎共め！　足元見やがって！！　これじゃあ、薬代どころか服だってまともに買えないじゃないか！」



　薄汚い言葉と共に、帽子に隠れるほど短く切られた金絹の髪が舞った。

　フェリックス、否、フェリシアはギュッとスカスカの財布を握りしめた。











　馬車と財産は失ったが、幸いにも大きな怪我をすることはなかった。

　結果として、フェリシアたちは何とか街に辿り着くことができた。



　しかし財産を失った代償は大きかった。

　何とか生活費を稼ぐために服を売り、そして長く美しかった髪も売り払ってしまった。

　それでも……仕事がなければ、お金は減る一方だ。



　当初、フェリシアの父親――アンガス――は楽観視していた。

　自分には貴族として受けた教育が、知識があり、読み書きも計算もできる。

　食い扶持くらいは稼げるだろう……と。



　しかしそれは大きな間違いだった。　

　というのも、この街ではそういう識字能力や計算能力が必要となる人材は十分に間に合っていたのだ。

　つまり頭脳労働ができるような働き口はなかった。



　そして……貴族であるアンガスに肉体労働など、できるはずもない。

　結果、借金だけが膨れ上がった。



　やがて自暴自棄になったアンガスは酒と賭博に嵌まり……フェリシアたちに莫大な借金を残して、どこかへと消えてしまった。



　勿論、フェリシアの母親――フローレンス――がまともに働けるはずもない。

　故に全ての負担はフェリシアの小さな両肩に預けられた。



　女であることを隠すために男装をし、顔に泥を塗って汚し、口調を男口調に矯正し、髪を切り、そしてフェリックスという偽名を名乗るようにした。

　そして真冬であるにも関わらず、半袖半ズボンの薄着に、盗んだボロボロの帽子、そして裸足という姿で、ゴミ漁り、靴磨き、物乞い、窃盗でなんとか日々の生活費を稼いでいる。









　僅かではあるがしばらくの生活費を手にしたフェリシアは今、住んでいる家へと向かった。

　その建物は家……というよりは、今にも壊れてしまいそうな小屋だった。

　辛うじて風雨を凌げる程度、強風が吹けばあっという間に吹き飛んでしまいそう……そんな小屋だ。



　フェリシアは歯を食いしばり、僅かに目じりに浮かんでいた涙を拭うと、明るい表情で扉を開けた。



「お母様、戻り……」

「あなた！　戻って……ああ、フェリシアね」



　ゲホゲホと咳き込みながら、落胆した様子で、簡素なベッドに横たわった女性――フェリシアの母、フローレンス――は言った。



　夫に見捨てられたことで、フローレンスは精神的に病んでしまった。

　心が弱れば、体も弱る。

　そして不衛生な環境で、まともに暖も取れず、食事すらも覚束ない環境で……



　病気に罹るのは、必然だった。



「げほっげほっ……」

「ダメだ、お母様……寝てないと……」



　フェリシアは慌ててフローレンスに駆け寄る。

　フローレンスをベッドに寝かせてから、銀貨を見せる。



「今日、お父様がこんなにくれましたよ！　これで美味しい物を食べられます！！」

「……アンガス様は、いつ戻って来れるの？」

「あ、あー、ま、まだ仕事が忙しいみたいです。でも、直に帰って来れるって！」



　アンガスは家族と離れ、少し遠い場所で住み込みで働いている。

　……ということになっていた。



　これはフローレンスの妄想だ。

　そう信じ込まないと、彼女は生きていられないのだ。



　そしてフェリシアもその妄想に乗っていた。

　まさか、窃盗をしているなどとは口が裂けても言えない。



「そう……また会えたら、待ってるって、伝えて」

「は、はい！　分かりました、必ず伝えます。お母様！」



　フェリシアはフローレンスの手を握りしめて言った。

　それからフローレンスは心配そうな声音で言った。



「フェリシア。あなた、最近……怪我をして帰ってくることがあるけど……」



　ゴミ漁りや靴磨き、物乞いの場所取りでは喧嘩はしょっちゅうだ。

　そして窃盗に失敗すれば、暴行を受けることもある。



　だから生傷が絶えない。



「……無理だけは、しないでね」

「はい、お母様」



　フェリシアは大きく頷いた。

　そして……決意するのだ。



　多少危険があっても、森に入り、魔導師マーリンを見つけよう。

　そして……病気を治す薬を貰ってこよう、と。



鬱々しいのはここで終わりで、次回から好転します"""

# 1行1文となっているため、改行コードで分離
sentences = [t for t in text.split('\n')]
for i in range(2):
    print(sentences[i])
# 転職 Advent Calendar 2016 - Qiitaの14日目となります。 少しポエムも含みます。
# 今年11月にSIerからWebサービスの会社へ転職しました。

# 形態素解析器を作る
analyzer = Analyzer(
    [UnicodeNormalizeCharFilter(), RegexReplaceCharFilter(
        r'[(\)「」、。]', ' ')],  # ()「」、。は全てスペースに置き換える
    JanomeTokenizer(),
    [POSKeepFilter(['名詞', '形容詞', '副詞', '動詞']), ExtractAttributeFilter(
        'base_form')]  # 名詞・形容詞・副詞・動詞の原型のみ
)

# 抽出された単語をスペースで連結
# 末尾の'。'は、この後使うtinysegmenterで文として分離させるため。
corpus = [' '.join(analyzer.analyze(s)) + '。' for s in sentences]


# 連結したcorpusを再度tinysegmenterでトークナイズさせる
parser = PlaintextParser.from_string(''.join(corpus), Tokenizer('japanese'))

summarizer = LexRankSummarizer()
summarizer.stop_words = [' ']  # スペースも1単語として認識されるため、ストップワードにすることで除外する

summarizer_luhn = LuhnSummarizer()
summarizer_luhn.stop_words = [' ']

summary_luhn = summarizer_luhn(document=parser.document, sentences_count=50)

print('要約しました')
for sentence in summary_luhn:
    print(sentences[corpus.index(sentence.__str__())])

# summary = summarizer(document=parser.document, sentences_count=2)
# 元の文を表示
# for sentence in summary:
#     print(sentences[corpus.index(sentence.__str__())])
